src/test/tsungbak.xml
<?xml version="1.0"?><!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd"><tsung loglevel="notice" version="1.0">	<clients>		<!-- <client host="iZ23a3vedmvZ" use_controller_vm="false" maxusers="1000"></client> -->		<!-- <client host="localhost" use_controller_vm="false" maxusers="1000"></client> -->		<client host="iZ23skerru2Z" use_controller_vm="false" maxusers="1000"></client>	</clients>	<!-- Server side setup -->	<servers>		<!-- <server host="120.26.50.187" port="5222" type="tcp"></server> -->		<server host="101.37.99.150" port="5222" type="tcp"></server>		<!-- <server host="192.168.1.156" port="5222" type="tcp"></server> -->	</servers>	<load>		<arrivalphase phase="1" duration="300" unit="minute">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="25" unit="second"></users>		</arrivalphase>	</load>	<!-- JABBER parameters -->	<!-- to synchronise users, use a global acknoledgement -->	<options>		<option type="ts_jabber" name="global_number" value="1000"></option>		<option type="ts_jabber" name="userid_max" value="100000"></option>		<option type="ts_jabber" name="domain" value="erlang-projects.org"></option>		<option type="ts_jabber" name="username" value="tsung"></option>		<option type="ts_jabber" name="passwd" value="tsung"></option>	</options>	<sessions>		<!-- <session probability="100" name="jabber-example" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack" />			</request>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>		</session> -->				<session probability="100" name="jabber-example" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>					<request>				<jabber type="presence:initial" ack="no_ack" />			</request>			<thinktime value="2"></thinktime>					<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>					 <for from="1" to="10000" var="i">		        <thinktime value="2"/>		        <transaction name="online">				   <request> <jabber type="chat" ack="no_ack" size="16" destination="online"></jabber> </request>				</transaction>		    </for>					<thinktime value="30"></thinktime>					<transaction name="close">				<request>					<jabber type="close" ack="no_ack"></jabber>				</request>			</transaction>				</session>	</sessions></tsung>